---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInDesignOptionWarn
source: html/0c90ee2e-2479-96d4-42a2-aa916c68bcb6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInDesignOptionWarn Property

A pad in the main model cannot be hosted by topography in a Design Option [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingPadByElementsInDesignOptionWarn { get; }
```